wmy2370cn/nxp-lpc/trunk/NXP-LPC/V7/Bsp/LPC2468/bsp.c
/*
*********************************************************************************************************
*                                     MICRIUM BOARD SUPPORT SUPPORT
*
*                          (c) Copyright 2003-2006; Micrium, Inc.; Weston, FL
*
*               All rights reserved.  Protected by international copyright laws.
*               Knowledge of the source code may NOT be used to develop a similar product.
*               Please help us continue to provide the Embedded community with the finest
*               software available.  Your honesty is greatly appreciated.
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*
*                                        BOARD SUPPORT PACKAGE
*
*                                             NXP LPC2468
*                                                on the
*                                  Embedded Artists LPC2468 OEM Board
*
* Filename      : bsp.c
* Version       : V1.00
* Programmer(s) : Brian Nagel
*********************************************************************************************************
*/

#define  BSP_GLOBALS
#include <LPC24xx.H>
#include <includes.h>  
#include "ioLPC24xx.H"
#include "smartarm2300.h"
#include "TimerExt.h"

/*
*********************************************************************************************************
*                                               DATA TYPES
*********************************************************************************************************
*/

typedef  void (*BSP_FNCT_PTR)(void);                            /* Pointer to ISR handler function                          */

/*
*********************************************************************************************************
*                                              VARIABLES
*********************************************************************************************************
*/

        CPU_INT32U  VIC_SpuriousInt;

/*
*********************************************************************************************************
*                                              PROTOTYPES
*********************************************************************************************************
*/

static  void  PLL_Init          (void);
static  void  MAM_Init          (void);
static  void  GPIO_Init         (void);
static  void  VIC_Init          (void);
static  void  ADC_Init          (void);

static  void  DCC_Init          (void);

static  void  Tmr_TickInit      (void);

static  void  VIC_Dummy         (void);                         /* Prototypes for dummy interrupt handlers                  */
static  void  VIC_DummyWDT      (void);
static  void  VIC_DummySW       (void);
static  void  VIC_DummyDEBUGRX  (void);
static  void  VIC_DummyDEBUGTX  (void);
static  void  VIC_DummyTIMER0   (void);
static  void  VIC_DummyTIMER1   (void);
static  void  VIC_DummyUART0    (void);
static  void  VIC_DummyUART1    (void);
static  void  VIC_DummyPWM01    (void);
static  void  VIC_DummyI2C0     (void);
static  void  VIC_DummySPI      (void);
static  void  VIC_DummySSP1     (void);
static  void  VIC_DummyPLL      (void);
static  void  VIC_DummyRTC      (void);
static  void  VIC_DummyEINT0    (void);
static  void  VIC_DummyEINT1    (void);
static  void  VIC_DummyEINT2    (void);
static  void  VIC_DummyEINT3    (void);
static  void  VIC_DummyAD0      (void);
static  void  VIC_DummyI2C1     (void);
static  void  VIC_DummyBOD      (void);
static  void  VIC_DummyETHERNET (void);
static  void  VIC_DummyUSB      (void);
static  void  VIC_DummyCAN01    (void);
static  void  VIC_DummyMMC      (void);
static  void  VIC_DummyGP_DMA   (void);
static  void  VIC_DummyTIMER2   (void);
static  void  VIC_DummyTIMER3   (void);
static  void  VIC_DummyUART2    (void);
static  void  VIC_DummyUART3    (void);
static  void  VIC_DummyI2C2     (void);
static  void  VIC_DummyI2S      (void);

/*
******************************************************************************************************************************
******************************************************************************************************************************
**                                         Global Functions
******************************************************************************************************************************
******************************************************************************************************************************
*/

/*
*********************************************************************************************************
*                                         BSP INITIALIZATION
*
* Description : This function should be called by your application code before you make use of any of the
*               functions found in this module.
*
* Arguements  : None
*
* Returns     : None
*********************************************************************************************************
*/

void  BSP_Init (void)
{
  //  PLL_Init();                                                 /* Initialize the PLL                                       */
  //  MAM_Init();                                                 /* Initialize the Memory Acceleration Module                */
    GPIO_Init();                                                /* Initialize the board's I/Os                              */
 //   ADC_Init();                                                 /* Initialize the board's ADCs                              */
    VIC_Init();                                                 /* Initialize the Vectored Interrupt Controller             */
 //   I2C_Init();                                                 /* Initialize the I2C                                       */

    Tmr_TickInit();                                             /* Initialize the uC/OS-II tick interrupt                   */
}


