wmy2370cn/nxp-lpc/trunk/NXP-LPC/V7/Bsp/LPC2468/bsp.c
                                                                        /* If this exception is either an IRQ or FIQ                */
    if ((ID == OS_CPU_ARM_EXCEPT_IRQ) || (ID == OS_CPU_ARM_EXCEPT_FIQ)) {
        pfnct = (BSP_FNCT_PTR)VICVectAddr;                               /* Read the interrupt vector from the VIC                   */
        if (pfnct != (BSP_FNCT_PTR)0) {                                 /* Make sure we don't have a NULL pointer                   */
          (*pfnct)();                                                   /* Execute the ISR for the interrupting device              */
            VICVectAddr  =  1;                                           /* Acknowlege the VIC interrupt                             */
        }
    }
}


/*
******************************************************************************************************************************
******************************************************************************************************************************
**                                       PB, LED, and ADC Functions
******************************************************************************************************************************
******************************************************************************************************************************
*/

/*
*********************************************************************************************************
*                                         GET 'PUSH BUTTON' STATUS
*
* Description : This function is used to get the status of any push button on the board.
*
* Arguments   : pb           is the number of the push button to probe
*                              1    probe the push button B1
*
* Returns     : DEF_TRUE     if the push button is     pressed
*               DEF_FALSE    if the push button is not pressed
*********************************************************************************************************
*/

CPU_BOOLEAN  PB_GetStatus (CPU_INT08U pb)
{
    CPU_INT08U   reg;
    CPU_INT08U   data;
    CPU_BOOLEAN  status;


    status      = DEF_FALSE;

    if (pb >= 1 && pb <= 4) {
        reg     = 0x00;
        data    = 0xFF;
        I2C_ReadReg(&data, 1, reg);
    }


    switch (pb) {
        case 1:
             if ((data & 0x01) == 0) {
                 status = DEF_TRUE;
             }
             break;

        case 2:
             if ((data & 0x02) == 0) {
                 status = DEF_TRUE;
             }
             break;

        case 3:
             if ((data & 0x04) == 0) {
                 status = DEF_TRUE;
             }
             break;

        case 4:
             if ((data & 0x08) == 0) {
                 status = DEF_TRUE;
             }
             break;

        case 5:
             if ((FIO2PIN & DEF_BIT_10) == 0) {
                 status = DEF_TRUE;
             }
             break;

        default:
             break;
    }

    return (status);
}


/*
*********************************************************************************************************
*                                         ADC INITIALIZATION
*
* Description : This function initializes the board's ADC
*
* Arguments   : none
*
* Returns     : none
*********************************************************************************************************
*/

static  void  ADC_Init (void)
{
    CPU_INT08U  div;
    CPU_INT32U  pinsel;


    PCONP      |=  DEF_BIT_12;

    div         = (BSP_CPU_PclkFreq(PCLK_ADC) / 4500000) + 1;
                                                                /* Configure ADC ...                                        */
    AD0CR       = (0x03 <<  0)                                  /*  ... Sample/convert pin AD0.0 and AD0.1 ...              */
                | (div  <<  8)                                  /*  ... Set divider so sample freq. < 4.5 MHz ...           */
                |  DEF_BIT_16                                   /*  ... Use burst mode for continuous conversion ...        */
                | (0x00 << 17)                                  /*  ... Use 11 clocks per conversion for 10-bit accuracy ...*/
                |  DEF_BIT_21;                                  /*  ... Power up the ADC.                                   */

                                                                /* Select AD0.0, AD0.1 function for P0.23, P0.24            */
    pinsel      = PINSEL1;
    pinsel     &= 0xFFFC3FFF;
    pinsel     |= 0x00014000;
    PINSEL1     = pinsel;
}


/*
*********************************************************************************************************
*                                           ADC STATUS
*
* Description : This function initializes the board's ADC
*
* Arguments   : adc     is the number of the ADC to probe.
*                       0  probes AD0.0, the right-hand potentiometer
*                       1  probes AD0.1, the left-hand  potentiometer
*
* Returns     : The numerator of the binary fraction representing the result of the latest ADC conversion.
*               This value will be a 10-bit value between 0x0000 and 0x03FF, inclusive.
*********************************************************************************************************
*/

CPU_INT16U  ADC_GetStatus (CPU_INT08U  adc)
{
    if (adc == 0) {
        return ((AD0DR0 >> 6) & 0x03FF);
    } else if (adc == 1) {
        return ((AD0DR1 >> 6) & 0x03FF);
    } else {
        return (0);
    }
}
   

/*
*********************************************************************************************************
*                                       TICKER INITIALIZATION
*
* Description : This function is called to initialize uC/OS-II's tick source (typically a timer generating
*               interrupts every 1 to 100 mS).
*
* Arguments   : none
*
* Returns     ; none
*********************************************************************************************************
*/

static  void  Tmr_TickInit (void)
{
    CPU_INT32U  pclk_freq;
    CPU_INT32U  rld_cnts;

