wmy2370cn/nxp-lpc/trunk/NXP-LPC/V7/Bsp/LPC2468/bsp.c
                                                                /* VIC timer #0 Initialization                              */
    VICIntSelect       &= ~(1 << VIC_TIMER0);                   /* Configure the timer interrupt as an IRQ source           */
    VICVectAddr4        =  (CPU_INT32U)Tmr_TickISR_Handler;     /* Set the vector address                                   */
    VICIntEnable        =  (1 << VIC_TIMER0);                   /* Enable the timer interrupt source                        */

    pclk_freq           =   BSP_CPU_PclkFreq(PCLK_TIMER0);      /* Get the peripheral clock frequency                       */

    rld_cnts            =   pclk_freq / OS_TICKS_PER_SEC;       /* Calculate the # of counts necessary for the OS ticker    */

    T0TCR               =  (1 << 1);                            /* Disable and reset counter 0 and the prescale counter 0   */
    T0TCR               =   0;                                  /* Clear the reset bit                                      */
    T0PC                =   0;                                  /* Prescaler is set to no division                          */

    T0MR0               =   rld_cnts;
    T0MCR               =   3;                                  /* Interrupt on MR0 (reset TC), stop TC                     */

    T0CCR               =   0;                                  /* Capture is disabled.                                     */
    T0EMR               =   0;                                  /* No external match output.                                */
    T0TCR               =   1;                                  /* Enable timer 0                                           */
}


/*
*********************************************************************************************************
*                                         TIMER #0 IRQ HANDLER
*
* Description : This function handles the timer interrupt that is used to generate TICKs for uC/OS-II.
*
* Arguments   : none
*
* Returns     ; none
*********************************************************************************************************
*/

void  Tmr_TickISR_Handler (void)
{
    T0IR        = 0xFF;                                         /* Clear timer #0 interrupt                                 */

    OSTimeTick();                                               /* Call uC/OS-II's OSTimeTick()                             */
	ExtTimerTick();
}
/*
******************************************************************************************************************************
******************************************************************************************************************************
**                                       Serial Port Communications
******************************************************************************************************************************
******************************************************************************************************************************
*/

/*
*********************************************************************************************************
*                                                   Ser_Init
*
* Description :   This function prepares UART0.
*
* Arguments   :   None.
*
* Returns     :   None.
*********************************************************************************************************
*/

void  Ser_Init (void)
{
    CPU_INT16U  div;                                            /* Baud rate divisor                                        */
    CPU_INT08U  divlo;
    CPU_INT08U  divhi;
    CPU_INT08U  lcr;										    /* Line Control Register                                    */
    CPU_INT32U  pclk_freq;
    CPU_INT32U  pinsel;


#if SER_COMM_SEL == SER_UART_0
                                                                /* Compute divisor for desired baud rate                    */
    pclk_freq   =  BSP_CPU_PclkFreq(PCLK_UART0);                /* Get the CPU clock frequency                              */

    div         = (CPU_INT16U)(((2 * pclk_freq / 16 / 115200) + 1) / 2);
    divlo       =  div & 0x00FF;                                /* Split divisor into LOW and HIGH bytes                    */
    divhi       = (div >> 8) & 0x00FF;
    lcr         =  DEF_BIT_00 | DEF_BIT_01;                     /* 8 Bits, 1 Stop, No Parity                                */

                                                                /* Configure P0.2 & P0.3 for UART0                          */
    pinsel      = PINSEL0;
    pinsel     &= 0xFFFFFF0F;
    pinsel     |= 0x00000050;
    PINSEL0     = pinsel;

    U0LCR       = DEF_BIT_07;                                   /* Set divisor access bit                                   */
    U0DLL       = divlo;                                        /* Load divisor                                             */
    U0DLM       = divhi;
    U0LCR       = lcr;                                          /* Set line control register (Bit 8 is 0)                   */
    U0IER       = 0x00;                                         /* Disable both Rx and Tx interrupts                        */
    U0FCR       = DEF_BIT_00 | DEF_BIT_01 | DEF_BIT_02;         /* Enable FIFO, flush Rx & Tx                               */
#endif

#if SER_COMM_SEL == SER_UART_1
                                                                /* Compute divisor for desired baud rate                    */
    pclk_freq   =  BSP_CPU_PclkFreq(PCLK_UART1);                /* Get the CPU clock frequency                              */

    div         = (CPU_INT16U)(((2 * pclk_freq / 16 / 115200) + 1) / 2);
    divlo       =  div & 0x00FF;                                /* Split divisor into LOW and HIGH bytes                    */
    divhi       = (div >> 8) & 0x00FF;
    lcr         =  DEF_BIT_00 | DEF_BIT_01;                     /* 8 Bits, 1 Stop, No Parity                                */

                                                                /* Configure P3.16 & P3.17 for UART1                        */
    pinsel      = PINSEL7;
    pinsel     &= 0xFFFFFFF0;
    pinsel     |= 0x0000000F;
    PINSEL7     = pinsel;

    U1LCR       = DEF_BIT_07;                                   /* Set divisor access bit                                   */
    U1DLL       = divlo;                                        /* Load divisor                                             */
    U1DLM       = divhi;
    U1LCR       = lcr;                                          /* Set line control register (Bit 8 is 0)                   */
    U1IER       = 0x00;                                         /* Disable both Rx and Tx interrupts                        */
    U1FCR       = DEF_BIT_00 | DEF_BIT_01 | DEF_BIT_02;         /* Enable FIFO, flush Rx & Tx                               */
#endif
}

