wmy2370cn/nxp-lpc/trunk/NXP-LPC/V7/Bsp/LPC2468/bsp.c
/*
*********************************************************************************************************
*                                                Ser_WrByte
*
* Description :   Transmit a single byte using UART0
*
* Arguments   :   The byte that should be transmitted.
*
* Returns     :   None.
*********************************************************************************************************
*/

void  Ser_WrByte (CPU_INT08U tx_byte)
{
#if SER_COMM_SEL == SER_UART_0
    U0THR       = tx_byte;
#endif

#if SER_COMM_SEL == SER_UART_1
    U1THR       = tx_byte;
#endif
}

/*
*********************************************************************************************************
*                                                Ser_WrStr
*
* Description :   Transmits a string using UART0
*
* Arguments   :   The string that will be transmitted.
*
* Returns     :   None.
*********************************************************************************************************
*/

void  Ser_WrStr (const CPU_CHAR * tx_str)
{
    while ((*tx_str) != 0) {
        Ser_WrByte(*tx_str++);
#if SER_COMM_SEL == SER_UART_0
        while ((U0LSR & DEF_BIT_05) == 0) {
            OSTimeDly(1);
        }
#endif

#if SER_COMM_SEL == SER_UART_1
        while ((U1LSR & DEF_BIT_05) == 0) {
            OSTimeDly(1);
        }
#endif
    }
}

/*
*********************************************************************************************************
*                                                Ser_RdByte
*
* Description :   Receive a single byte using UART0
*
* Arguments   :   None.
*
* Returns     :   The received byte
*********************************************************************************************************
*/

CPU_INT08U  Ser_RdByte (void)
{
    CPU_INT08U  rx_byte;


#if SER_COMM_SEL == SER_UART_0
    while ((U0LSR & DEF_BIT_00) == 0) {
        OSTimeDly(1);
    }

    rx_byte = (CPU_INT08U)(U0RBR);                              /* Remove the data from the holding register                */
    return (rx_byte);
#endif

#if SER_COMM_SEL == SER_UART_1
    while ((U1LSR & DEF_BIT_00) == 0) {
        OSTimeDly(1);
    }

    rx_byte = (CPU_INT08U)(U1RBR);                              /* Remove the data from the holding register                */
    return (rx_byte);
#endif
}

/*
*********************************************************************************************************
*                                                Ser_RdStr
*
* Description :   This function reads a string using Channel 0 of the UART.
*
* Arguments   :   s      A pointer to a buffer at which the string can be stored
*                 len    The size of the string that will be read
*
* Returns     :   None
*********************************************************************************************************
*/

void  Ser_RdStr (CPU_CHAR    *rx_str,
                 CPU_INT32U   len)
{
    CPU_CHAR  input;
    CPU_CHAR  input_ix;


    input_ix  = 0;
    rx_str[0] = 0;

    while (1)
    {
        input = Ser_RdByte();

        if ((input == '\r') ||
            (input == '\n')) {
            Ser_Printf("\n");
            rx_str[input_ix] = 0;
            break;
        }

        if (input == '\b') {
            if (input_ix > 0) {
                Ser_Printf("\b \b");
                input_ix--;
                rx_str[input_ix] = 0;
            }
        }

        if (Str_IsPrint(input)) {
            Ser_Printf("%c", input);
            rx_str[input_ix] = input;
            input_ix++;
            if (input_ix >= len) {
               input_ix = len;
            }
        }
    }
}

/*
*********************************************************************************************************
*                                                Ser_Printf
*
* Description :   Formatted outout to the serial port.
*                 This funcion reads a string from a serial port. This call blocks until a
*                 character appears at the port and the last character is a Carriage
*                 Return (0x0D).
*
* Arguments   :   Format string follwing the C format convention.
*
* Returns     :   None.
*********************************************************************************************************
*/

void  Ser_Printf (const  CPU_CHAR *format, ...)
{
    static  CPU_CHAR  buffer[80 + 1];
            va_list   vArgs;


    va_start(vArgs, format);
    vsprintf((char *)buffer, (char const *)format, vArgs);
    va_end(vArgs);

    Ser_WrStr((CPU_CHAR*) buffer);
}

/*
******************************************************************************************************************************
******************************************************************************************************************************
**                                         DCC Functions
******************************************************************************************************************************
******************************************************************************************************************************
*/

/*
*********************************************************************************************************
*                                         DCC INITIALIZATION
*
* Description : This function initializes the interrupts for DCC receive/transmit.
*
* Arguments   : none
*
* Returns     ; none
*********************************************************************************************************
*/

#if OS_CPU_ARM_DCC_EN > 0
static  void  DCC_Init (void)
{
                                                                /* VIC DEBUG RX Initialization                              */
    VICIntEnClear       =  (1 << VIC_DEBUGRX);                  /* Enable the timer interrupt source                        */
    VICIntSelect       &= ~(1 << VIC_DEBUGRX);                  /* Configure the DCC Rx function as an IRQ source           */
    VICVectAddr2        =  (CPU_INT32U)DCC_RxISR_Handler;       /* Set the vector address                                   */
    VICIntEnable        =  (1 << VIC_DEBUGRX);                  /* Enable the timer interrupt source                        */
}
#endif

